Autodesk.Revit.DB.FamilyThermalProperties.Find(Autodesk.Revit.DB.Document,System.String)
Finds the thermal properties by the 'id' property of a constructionType node in Constructions.xml.
pADoc:
The document.
constructionId:
The 'id' property of a constructionType node in Constructions.xml
Returns:
The thermal properties found, or null if no match was found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.FamilyThermalProperties.IsValid
Confirms that the thermal properties are correctly set for assignment to a FamilySymbol.
Returns:
True if the thermal properties are valid, false otherwise.
Since:
2015

Autodesk.Revit.DB.FamilyThermalProperties.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FamilyThermalProperties.ThermalResistance
The calculated thermal resistance value (R-Value).
The units are meter-squared kelvin per watt ((m^2*K)/Watt).
Since:
2013

Autodesk.Revit.DB.FamilyThermalProperties.AnalyticConstructionName
The construction gbXML name.
This value corresponds to the 'Name' property of a constructionType node in Constructions.xml.
Since:
2013

Autodesk.Revit.DB.FamilyThermalProperties.AnalyticConstructionTypeId
The construction gbXML type.
This value corresponds to the 'id' property of a constructionType node in Constructions.xml.
Since:
2013

Autodesk.Revit.DB.FamilyThermalProperties.VisualLightTransmittance
The visual light transmittance.
Since:
2013

Autodesk.Revit.DB.FamilyThermalProperties.SolarHeatGainCoefficient
The solar heat gain coefficient.
Since:
2013

Autodesk.Revit.DB.FamilyThermalProperties.HeatTransferCoefficient
The heat transfer coefficient value (U-Value).
The units are watts per meter-squared kelvin (W/(m^2*K)).
Since:
2013

Autodesk.Revit.DB.FamilyThermalProperties.#ctor
Constructs a new FamilyThermalProperties with default settings.
Since:
2013

Autodesk.Revit.DB.FamilyThermalProperties
A class that contains thermal properties for specific types of families
(doors, windows, and curtain wall panels).
Since:
2013